---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.FlowDirection
source: html/e8bf3786-8ce0-cf47-8170-c954997f4e39.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.FlowDirection Property

the flow direction of this connector, In or Out.

## Syntax (C#)
```csharp
public FlowDirectionType FlowDirection { get; }
```